[
  {
    "url": "https://www.bcaa.edu.sg/what-we-offer/academic-programmes/specialist-diploma/Details/specialist-diploma-in-architectural-technology-(sdat)",
    "title": "Specialist Diploma in Architectural Technology (SDAT)- Comprises 3 modular certificates",
    "description": "\n\nCLICK HEREfor Terms & Conditions\nThe building industry needs to adopt digital transformation as mapped out by BCA for the Built Environment sector. Architectural assistants and technologists need to be conversant with building regulatory requirements, green and sustainable buildings, principles of Universal Design, knowledge of the various M&E services that interphase with the design. and be equipped with digital skills in order to prepare documentation for authority electronic submission.\nYou will have the flexibility to take the modular certificates in any order and at your own pace*. The certificates can be stacked up towards the Specialist Diploma.\n*Maximum of 3 years to accumulate the certificates for an academic qualification\nThe Specialist Diploma in Architectural Technology will equip you with the necessary skills and knowledge to work as Architectural technologists in this revolutionary changing age of digital design. You will gain essential knowledge and skills on local building development guidelines, building regulations, integrated online submission of plans for approval, architectural detailing, and good practices. You will also be able to explore green building designs and work on creative universal design solutions for the built environment.Upon graduation, you can look forward to career opportunities in Architectural consultancies, Contractors and technical support sectors, such as Assistant Architects, Technical Officers, Architectural Coordinators, BIM Modellers or Architectural Product Specialists.\nPlanning Requirements\nBuilding Plan Requirements\nBIM Architectural Project\nTechnical Department Requirements\nGreen Building & Universal Design\nDesign for Productivity\nArchitectural Detailing\nDesign for Maintainability\nBuilding Services\nPlease clickherefor more information.Note: Registration closes 2 weeks prior to modular certificate commencement or when the class is fully subscribed, whichever comes first. Registration can remain open until course c"
  },
  {
    "url": "https://www.bcaa.edu.sg/what-we-offer/academic-programmes/specialist-diploma/Details/specialist-diploma-in-building-cost-management-(sdbcm)",
    "title": "Specialist Diploma in Building Cost Management (SDBCM)- Comprises 3 modular certificates",
    "description": "\n\nCLICK HEREfor Terms & Conditions\nThe design and construction of building projects is a highly complex and demanding process, especially with the increased sophistication of the various disciplines involved, such as architecture, surveying, construction and engineering. Delivering a project of such complexity within the right budget, quality and timescale is critical in meeting client’s expectations. Building cost management provides owners, developers, architects and contractors the highest degree of cost predictability over the life cycle of a building with the use of cost modelling and management techniques.\nThe Specialist Diploma in Building Cost Management (SDBCM) prepares you to manage construction cost planning and control right from project inception to the maintenance phase of a building. It provides you an opportunity to gain industry-specific skills and experience in cost estimates and analysis, budget forecasts, facilities planning, conceptual studies and bid comparisons for the design and construction of property. The curriculum also covers capital and operating cost assessment skills and project control decisions. Upon graduation, you can find career opportunities as quantity surveyors or cost managers in Singapore’s booming construction industry.\nYou will have the flexibility to take the modular certificates in any order and at your own pace*. The certificates can be stacked up towards the Specialist Diploma.\n*Maximum of 3 years to accumulate the certificates for an academic qualification\nThis diploma is designed for construction personnel who aspire to be Quantity Surveyor or Cost Manager. It is also suitable for professionals working in property and facility management who wish to enhance their knowledge of building cost management. It also provides an opportunity to gain industry-specific skills and experiences in cost estimates and analysis and budget forecasts which will be beneficial for resident technical officers and resident engineers.\nUpon "
  },
  {
    "url": "https://www.bcaa.edu.sg/what-we-offer/academic-programmes/specialist-diploma/Details/specialist-diploma-in-building-information-modelling-(sdbim)",
    "title": "Specialist Diploma in Building Information Modelling (SDBIM)- Comprises 2 modular certificates",
    "description": "\n\nCLICK HEREfor Terms & Conditions\nAs building projects become more complex, Building Information Modelling (BIM) has become an important tool to help building professionals improve their work effectiveness and efficiency. As an integrated design, documentation and construction tool, the strategic implementation of BIM in building projects would enhance communication and multi-disciplinary collaboration among all the project stakeholders, significantly improving the design, construction, and operation processes, with productivity gains and returns.\nYou will have the flexibility to take the modular certificates in any order and at your own pace*. The certificates can be stacked up towards the Specialist Diploma.\n*Maximum of 3 years to accumulate the certificates for an academic qualification.\nThis certificate enables learners to be proficient in BIM processes and develop strategic skills for BIM implementation, design documentation and coordination. Learners will be taught to perform qualitative design checks with BIM applications and perform design analysis on energy usage and simple structures.\nCourses offered:\nThis certificate enables learners to apply BIM in the construction and operation of building projects. It focuses on using BIM for the coordination, scheduling, quantification and on-time delivery of building projects. It also covers construction workflows, progress reviews, as-built models, as well as the application of BIM for Digital Asset Delivery to facilitate building operation downstream.\nCourses offered:\nPlease clickherefor more information.Note: Registration closes 2 weeks prior to modular certificate commencement or when the class is fully subscribed, whichever comes first. Registration can remain open until course commencement date if training spaces are still available.\nPlease clickherefor more information.\nNote: Registration closes 2 weeks prior to modular certificate commencement or when the class is fully subscribed, whichever comes first. Reg"
  },
  {
    "url": "https://www.bcaa.edu.sg/what-we-offer/academic-programmes/specialist-diploma/Details/specialist-diploma-in-computational-bim-(building)-(sdcbb)",
    "title": "Specialist Diploma in Computational BIM (Building) (SDCBB)- Comprises 2 modular certificates",
    "description": "\n\nCLICK HEREfor Terms & Conditions\nComputational BIM refers to the innovative problem-solving approach where users define algorithms to have automated generation and manipulation of building-related information for better work efficiency, effectiveness and productivity gains.\nYou will have the flexibility to take the modular certificates in any order and at your own pace*. The certificates can be stacked up towards the Specialist Diploma.\n*Maximum of 3 years to accumulate the certificates for an academic qualification\nBCA Academy offers Specialist Diploma programmes in Computational BIM to equip Built Environment professionals with skills and knowledge to apply computational BIM tools for automation, optimisation and validation of different types of projects. Under the modular certificate A (Course Code 79020A), learners will acquire knowledge on basic programming syntax to script across various types of computational BIM software. Learners could then specialise in Computational BIM for building (Course Code 79020B) projects and learn about applications, workflows, management and manipulation of data generated from BIM models for construction use, enabling better collaboration between various stakeholders.\nThis modular certificate equips learners with knowledge on basic coding and its application in customising BIM programmes.\nCourses Offered:\n^ Holders of BCA Certificate of Successful Completion in Computational BIM & graduates of BCA Diploma in Digital Engineering will be exempted from this subject\nThis modular certificate enables learners to apply simple scripts to supplement computational BIM tools. Learners will learn to use computational methods to automate, optimise and benchmark processes within a building’s lifecycle.\nCourses Offered:\nPlease clickherefor more information.Registration closes 2 weeks prior to commencement or when the class is fully subscribed, whichever comes first. Registration can remain open until course commencement date if training space"
  },
  {
    "url": "https://www.bcaa.edu.sg/what-we-offer/academic-programmes/specialist-diploma/Details/specialist-diploma-in-construction-management-(sdcm)",
    "title": "Specialist Diploma in Construction Management (SDCM)- Comprises 3 modular certificates",
    "description": "\n\nCLICK HEREfor Terms & Conditions\nIn land scarce Singapore, the building and construction industry plays a critical role in our city’s advancement and urban regeneration. With a high volume of building and infrastructure, the construction industry is offering great employment prospects and earning potential for construction professionals, such as project supervisors, project coordinators, construction managers and project managers.\nYou will have the flexibility to take the modular certificates in any order and at your own pace*. The certificates can be stacked up towards the Specialist Diploma.\n*Maximum of 3 years to accumulate the certificates for an academic qualification\nThe Specialist Diploma in Construction Management (SDCM) will equip you with skills that are essential in managing construction projects successfully. The comprehensive curriculum covering technical aspects, quality, safety, contract & cost management to legal studies and information technology will prepare you for n rewarding career in the dynamic construction industry.\nBuilding Services & Quality Management (MEP Systems)\nProject Management & IT Application\nManagement & Negotiation Skills\nConstruction Processes & Quality Management (Architecture & Structure)\nSupply Chain Management\nIntroduction to BIM\nManagement of Construction Contracts\nCost Management and Control Techniques\nBuilding Law\nPlease clickherefor more information.Note: Registration closes 2 weeks prior to modular certificate commencement or when the class is fully subscribed, whichever comes first. Registration can remain open until course commencement date if training spaces are still available.\nPlease clickherefor more information.\nNote: Registration closes 2 weeks prior to modular certificate commencement or when the class is fully subscribed, whichever comes first. Registration can remain open until course commencement date if training spaces are still available.\nPlease clickherefor more information.Note: Registration closes 2 w"
  },
  {
    "url": "https://www.bcaa.edu.sg/what-we-offer/academic-programmes/specialist-diploma/Details/specialist-diploma-in-construction-productivity-(sdcp)",
    "title": "Specialist Diploma in Construction Productivity (SDCP)- Comprises 2 modular certificates",
    "description": "\n\nCLICK HEREfor Terms & Conditions\nThe construction industry had been perceived as a labour-intensive and low-tech one. The adoption of technologies, streamlined work processes and best practices to boost construction productivity has revolutionised the way we build. To prepare the industry for such adoption, this programme aims to hone the skills and enhance the knowledge of built environment professionals in emerging areas such as Integrated Digital Delivery (IDD), Virtual Design & Construction (VDC), Lean Construction (LC), Pre-fabricated Bathroom Unit (PBU), Pre-fabricated and Prefinished Volumetric Construction (PPVC), Mass Engineered Timber (MET) and automation in construction.\nYou will have the flexibility to take the modular certificates in any order and at your own pace*. The certificates can be stacked up towards the Specialist Diploma.\n*Maximum of 3 years to accumulate the certificates for an academic qualification.\nAdvanced Certificate in Construction Productivity (ACCP) certificate equips construction industry professionals with the latest construction productivity trends and technology needed to attain higher technical competencies. Learners will gain critical knowledge in productivity improvement, process and quality improvement, management skills, value engineering, and DfMA principles. Learners will also comprehend the new construction technologies for different trades including challenges and benefits of building offsite.\nCertificate in Management of Productive Technologies, certificate equips learners with the knowledge and skill to apply DfMA concepts, digital technology, and lean construction process for project delivery. The advanced technologies applicable for the industry, such as those related to prefabrication and volumetric construction, 3D concrete printing, usage of drones in construction, will also be covered.\nCourses offered:\nCourses offered:\nNote:\nParticipants who complete Certificate A and Certificate B within 3 years will be awarded"
  },
  {
    "url": "https://www.bcaa.edu.sg/what-we-offer/academic-programmes/specialist-diploma/Details/specialist-diploma-in-facility---energy-management-(day-class)-(sdfem)",
    "title": "Specialist Diploma in Facility & Energy Management (Day Class) (SDFEM)",
    "description": "\n\nCLICK HEREfor Terms & Conditions\nEnvironment sustainability is increasingly gaining ground in the building and construction industry, buoyed by global concerns on climate change and limited natural resources. With the rising trend towards green technologies and renewable energy, there is a need for professionals who are proficient in energy management to operate buildings for optimal building performance.\nYou will have the flexibility to take the modular certificates in any order and at your own pace*. The certificates can be stacked towards the Specialist Diploma.\n*Maximum 3 years to accumulate the certificates for an academic qualification.\nThe Specialist Diploma in Facility and Energy Management (SDFEM) equips students with the essential knowledge to plan and manage building operations and maintenance efficiently. The programme incorporates Energy Management topics to give students the added competitive edge.\nUpon graduation, you can look forward to career opportunities as facilities managers or building managers.\nClickHEREto watch on YouTube\nIntroduction to Facilities Management\nBIM for Facilities Management\nIntegrated Digital Delivery for Facilities Management\nBuilding Management\nBuilding Mechanical Services\nBuilding Electrical Services\nEnergy Management\nPlease clickherefor more information.Note: Registration closes 2 weeks prior to commencement or when the class is fully subscribed, whichever comes first. Registration can remain open until course commencement date if training spaces are still available.\nPlease clickherefor more information.\nNote: Registration closes 2 weeks prior to commencement or when the class is fully subscribed, whichever comes first. Registration can remain open until course commencement date if training spaces are still available.\nPlease clickherefor more information.Note: Registration closes 2 weeks prior to commencement or when the class is fully subscribed, whichever comes first. Registration can remain open until course commenceme"
  },
  {
    "url": "https://www.bcaa.edu.sg/what-we-offer/academic-programmes/specialist-diploma/Details/specialist-diploma-in-facility---energy-management-(sdfem)",
    "title": "Specialist Diploma in Facility & Energy Management (SDFEM)- Comprises 3 modular certificates",
    "description": "\n\nCLICK HEREfor Terms & Conditions\nEnvironment sustainability is increasingly gaining ground in the building and construction industry, buoyed by global concerns on climate change and limited natural resources. With the rising trend towards green technologies and renewable energy, there is a need for professionals who are proficient in energy management to operate buildings for optimal building performance.\nYou will have the flexibility to take the modular certificates in any order and at your own pace*. The certificates can be stacked up towards the Specialist Diploma.\n*Maximum of 3 years to accumulate the certificates for an academic qualification\nThe Specialist Diploma in Facility and Energy Management (SDFEM) equips students with the essential knowledge to plan and manage building operations and maintenance efficiently.\nThe programme also incorporates Energy Management modules to give students the added competitive edge. Upon graduation, you can look forward to career opportunities as facilities managers or building managers.ClickHEREto watch on YouTube\nIntroduction to Facilities Management\nBIM for Facilities Management\nIntegrated Digital Delivery for Facilities Management\nBuilding Management\nBuilding Mechanical Services\nBuilding Electrical Services\nEnergy Management\nPlease clickherefor more information.Note: Registration closes 2 weeks prior to modular certificate commencement or when the class is fully subscribed, whichever comes first. Registration can remain open until course commencement date if training spaces are still available.\nPlease clickherefor more information.\nNote: Registration closes 2 weeks prior to modular certificate commencement or when the class is fully subscribed, whichever comes first. Registration can remain open until course commencement date if training spaces are still available.\nPlease clickherefor more information.Note: Registration closes 2 weeks prior to modular certificate commencement or when the class is fully subscribed, which"
  },
  {
    "url": "https://www.bcaa.edu.sg/what-we-offer/academic-programmes/specialist-diploma/Details/specialist-diploma-in-integrated-project-management-(sdipm)---second-stage",
    "title": "Specialist Diploma in Integrated Project Management (SDIPM) - SIPM214, 215, 216- Comprises 6 modular certificates",
    "description": "\n\nCLICK HEREfor Terms & Conditions\nIntegrated Planning and Design (IPD) has been identified as one of the key transformation areas that encourage collaborations among stakeholders in the Built Environment (BE) sector. IPD project management practices are critical to ensure collaboration and integration in the project design and delivery.The Specialist Diploma in Integrated Project Management (SDIPM) is specially designed for building professionals to enhance their project management skills to plan, manage and execute building projects collaboratively so as to reap the benefits of IPD.Course participants will be equipped with knowledge of emerging project management practices such as integrated procurement management and collaborative contracting.The SDIPM qualification can be attained through successful completion of five stackable short courses and one project assignment. Participants may take individual courses at their own pace or apply for the full programme at one go.\nYou will have the flexibility to take the courses in any order and at your own pace*. The courses can be stacked up towards the Specialist Diploma.\n*Maximum of 3 years to complete the requirements for an academic qualification\nThis course provides course participants with the fundamental knowledge of critical work functions of project management. It introduces the concepts and methods to plan and execute building and construction projects, evaluate and improve project performance, enabling participants to identify project requirements based on project size, scope and timeline, as well as prepare project planning and executive documents in compliance with key relevant regulatory requirements.\nThis course covers the Project Management Body of Knowledge required in the BE sector, including project management standards and core functions and project lifecycle, stakeholder and communication management, managing consultancy services and consultants’ contributions, time and productivity management, quali"
  },
  {
    "url": "https://www.bcaa.edu.sg/what-we-offer/academic-programmes/specialist-diploma/Details/specialist-diploma-in-integrated-project-management-(sdipm)",
    "title": "Specialist Diploma in Integrated Project Management (SDIPM) - SPIM211, 212, 213- Comprises 6 modular certificates",
    "description": "\n\nCLICK HEREfor Terms & Conditions\nIntegrated Planning and Design (IPD) has been identified as one of the key transformation areas that encourage collaborations among stakeholders in the Built Environment (BE) sector. IPD project management practices are critical to ensure collaboration and integration in the project design and delivery.The Specialist Diploma in Integrated Project Management (SDIPM) is specially designed for building professionals to enhance their project management skills to plan, manage and execute building projects collaboratively so as to reap the benefits of IPD.Course participants will be equipped with knowledge of emerging project management practices such as integrated procurement management and collaborative contracting.The SDIPM qualification can be attained through successful completion of five stackable short courses and one project assignment. Participants may take individual courses at their own pace or apply for the full programme at one go.\nYou will have the flexibility to take the courses in any order and at your own pace*. The courses can be stacked up towards the Specialist Diploma.\n*Maximum of 3 years to complete the requirements for an academic qualification\nThis course provides course participants with the fundamental knowledge of critical work functions of project management. It introduces the concepts and methods to plan and execute building and construction projects, evaluate and improve project performance, enabling participants to identify project requirements based on project size, scope and timeline, as well as prepare project planning and executive documents in compliance with key relevant regulatory requirements.\nThis course covers the Project Management Body of Knowledge required in the BE sector, including project management standards and core functions and project lifecycle, stakeholder and communication management, managing consultancy services and consultants’ contributions, time and productivity management, quali"
  },
  {
    "url": "https://www.bcaa.edu.sg/what-we-offer/academic-programmes/specialist-diploma/Details/specialist-diploma-in-m-e-coordination-(sdme)",
    "title": "Specialist Diploma in M&E Coordination (SDME)- Comprises 3 modular certificates",
    "description": "\n\nCLICK HEREfor Terms & Conditions\nThe growing complexity of Mechanical, Electrical and Plumbing (MEP) services in commercial, residential, industrial and infrastructural projects have made the role of an MEP coordinator increasingly important. Proper planning and coordination of MEP services are central to the success of building projects and play a key role in achieving building aesthetics, operational efficiency and optimal building maintenance.\nYou will have the flexibility to take the modular certificates in any order and at your own pace*. The certificates can be stacked up towards the Specialist Diploma.\n*Maximum of 3 years to accumulate the certificates for an academic qualification\nThe Specialist Diploma in M&E Coordination aims to equip individuals with the technical knowledge and managerial skills necessary to excel in the increasingly important role of an MEP coordinator. The program is designed to meet the growing complexity of Mechanical, Electrical, and site management in various building projects, with a focus on proper planning and coordination to achieve operational efficiency and optimal maintenance. Participants will gain industry-relevant expertise in MEP systems, including air-conditioning, mechanical ventilation, plumbing, electrical, telecommunication, and Building Automation Systems (BAS), along with comprehensive knowledge in site management.\nUpon completion, graduates will be prepared to take on roles such as MEP engineers, property executives, facilities executives, and can progress to advanced positions such as project managers or MEP managers. The program also serves as a recognized technical qualification for MEP work head registration under BCA’s Contractors Registry.\nClickHEREto watch on YouTube.\nAir-conditioning & Mechanical Ventilation (ACMV) Systems\nPlumbing Systems\nElectrical Systems\nTelecommunication Systems\nVertical Transportation Systems\nMEP Coordination & Submission\nProject Scheduling & Contract Administration\nSite Organizati"
  },
  {
    "url": "https://www.bcaa.edu.sg/what-we-offer/academic-programmes/specialist-diploma/Details/specialist-diploma-in-smart-facilities-management-(sdsfm)",
    "title": "Specialist Diploma in Smart Facilities Management (SDSFM)- Comprises 3 modular certificates",
    "description": "\n\nCLICK HEREfor Terms & Conditions\nThe Real Estate Industry Transformation Map (ITM), which was launched in 2018, seeks to transform the Facilities Management (FM) industry through leveraging technology and strengthening professionalism. One key strategy to transform the FM industry is to enhance its maintenance capabilities through smart FM. Smart FM refers to the integration of systems, processes, technologies and personnel to enhance the management of a building's facilities. By using smart FM and leveraging data analytics, predictive maintenance and smart technology solutions, we can raise productivity and efficiency, reduce labour intensity, and enhance service delivery and quality.\nWith the increasing demand for smart buildings, enhanced skillsets in Smart FM are required for personnel who are involved in the planning, design, construction and maintenance of such buildings. The Specialist Diploma in Smart Facilities Management (SDSFM) is designed to equip Built Environment professionals with the essential knowledge to plan and manage building operations and maintenance efficiently with the adoption of smart FM. It covers the principles, processes, operating models, technologies and applications of Smart FM. The programme is offered in a modular format.\nYou will have the flexibility to take the modular certificates in any order and at your own pace*. The certificates can be stacked up towards the Specialist Diploma.\n*Maximum of 3 years to accumulate the certificates for an academic qualification\nThe objective of SDSFM aims to provide learners with a comprehensive understanding of fundamental principles, risk management, and legislation in Facilities Management, while also introducing them to key technologies such as Building Information Modelling (BIM), data analytics, and Internet of Things (IoT). Additionally, the program offers an overview of the Smart FM framework, covering the Smart FM infrastructure, Design for Maintainability, Energy Conservation Techniq"
  },
  {
    "url": "https://www.bcaa.edu.sg/what-we-offer/academic-programmes/specialist-diploma/Details/specialist-diploma-in-sustainability---carbon-management-for-the-built-environment-(sdscm)",
    "title": "Specialist Diploma in Sustainability & Carbon Management for the Built Environment (SDSCM)- Comprises 2 modular certificates",
    "description": "\n\nCLICK HEREfor Terms & Conditions\n\n\n\n\nClickherefor more information.Registration closes 2 weeks prior to modular certificate commencement or when the class is fully subscribed, whichever comes first. Registration can remain open until course commencement date if training spaces are still available.\nClickherefor more information.\nRegistration closes 2 weeks prior to modular certificate commencement or when the class is fully subscribed, whichever comes first. Registration can remain open until course commencement date if training spaces are still available.\nClickherefor more information.Registration closes 2 weeks prior to modular certificate commencement or when the class is fully subscribed, whichever comes first. Registration can remain open until course commencement date if training spaces are still available.\nClickherefor more information.\nRegistration closes 2 weeks prior to modular certificate commencement or when the class is fully subscribed, whichever comes first. Registration can remain open until course commencement date if training spaces are still available.\nUpon completion, participants shall be awarded the Modular Certificate on Sustainable Building Design Strategies.\nParticipant must achieve at least 75% attendance and pass all assessments. BCA Academy reserves the right to recover the funded amount from the participant (self-sponsored) or employer (company sponsored) if participant did not meet the eligibility criteria. Details of SSG’s funding can be found onHome (skillsfuture.gov.sg).\nCLICK HEREfor Terms & Conditions\nTo keep yourself updated with BCA Academy's courses and events, sign up with us TODAY!\n© 2023 BCA Academy."
  },
  {
    "url": "https://www.bcaa.edu.sg/what-we-offer/academic-programmes/specialist-diploma/Details/specialist-diploma-in-underground-construction-(sduc)",
    "title": "Specialist Diploma in Underground Construction (SDUC)- Comprises 3 modular certificates",
    "description": "\n\nCLICK HEREfor Terms & Conditions\nLand-scarce Singapore has historically looked to build both upward with taller buildings and outward by reclaiming land from sea. Another area that Singapore could do more with, is its underground space. The underground space holds possibilities for creating additional subterranean transport hubs, pedestrian links, cycling lanes, utility plants, storage and research facilities, industrial uses, shopping areas and other public spaces. Developing competency in the area of underground construction is critical to realizing such subterranean construction projects.\nYou will have the flexibility to take the modular certificates in any order and at your own pace*. The certificates can be stacked up towards the Specialist Diploma.\n*Maximum of 3 years to accumulate the certificates for an academic qualification\nThe Specialist Diploma in Underground Construction aims to equip Contractors and Consultants at the supervisory level with the knowledge in geotechnical design concepts, considerations and construction techniques so as to support increasingly complex and challenging underground construction projects.\nClickHEREto watch on YouTube\nEngineering Geology, Soil Mechanics and Rock Mechanics\nThis course covers the engineering geology, soil mechanics and rock mechanics.\nGeotechnical Investigation and Monitoring\nThis course introduces the geotechnical investigation techniques and monitoring scheme.\nUnderground Development\nThis course covers the potential usage of underground spaces, rules and regulations of underground construction and the health and safety aspect consideration for underground development.\nConstruction Techniques for Basements\nThis course provides students with essential knowledge in underground construction design for earth retaining systems and reinforcement as well as construction techniques. It also covers the mechanical and maintenance aspect of underground development, use of building information modelling in underground c"
  },
  {
    "url": "https://www.bcaa.edu.sg/what-we-offer/academic-programmes/specialist-diploma/Details/specialist-diploma-in-virtual-design---construction-(sdvdc)",
    "title": "Specialist Diploma in Virtual Design & Construction (SDVDC)- Comprises 2 modular certificates",
    "description": "\n\nCLICK HEREfor Terms & Conditions\nVirtual Design and Construction (VDC) is an integrated approach that combines Building Information Modelling (BIM) and advanced management methods to improve productivity. VDC will benefit both consultants and contractors to achieve productivity gains in upstream and downstream of both design and construction phases. This programme provides insights into VDC methodologies such as Integrated Concurrent Engineering and Process and Production Management. Learners will be able to apply these VDC methodologies to streamline project workflow and improve business performances.\nYou will have the flexibility to take the modular certificates in any order and at your own pace*. The certificates can be stacked up towards the Specialist Diploma.\n*maximum of 3 years to accumulate the certificates for an academic qualification\nThe objective of the Specialist Diploma in Virtual Design and Construction (VDC) offered by BCA Academy is to equip participants with the knowledge and skills to effectively apply virtual design and construction technologies in the built environment industry. This includes understanding the principles of Building Information Modelling (BIM), virtual design coordination, and the use of digital tools for construction planning and management. The course aims to prepare participants to contribute to the advancement of construction practices through the application of VDC methodologies.\nBy the end of this certificate, learners will be able to apply the various VDC principles into their line of work, and to effectively measure the productivity outcome of their applications.\nCourses Offered:\nBy the end of this certificate, learners will be able to apply various VDC methodologies and tools in streamlining work processes during construction phase.\nCourses Offered:\nPlease clickherefor more information.Registration closes 2 weeks prior to modular certificate commencement or when the class is fully subscribed, whichever comes first. Re"
  }
]